{
    "LANCER-ALT-STRUCTURE": {
        "StructureDescriptions": {
            "noStructure": "Your mech is damaged beyond repair – it is destroyed. You may still exit it as normal.",
            "crushingHit": "Roll a <strong>HULL</strong> check. On a success, until the end of your next turn, your mech cannot take its standard move, reactions, or free actions of any kind, including protocols, and during your next turn, you can only take 1 quick action. On a Failure, your mech is immediately destroyed.",
            "directHit": {
                "base": "Your mech is @Compendium[world.status-items.Stunned] until the end of your next turn.",
                "one":"You take the SYSTEM TRAUMA result from this table and must roll a <strong>HULL</strong> check. On a success, your mech is @Compendium[world.status-items.Impaired] and @Compendium[world.status-items.Slowed] until the end of your next turn. On a Failure, Your mech is @Compendium[world.status-items.Stunned] until the end of your next turn. If there are no valid weapons or systems remaining, this result becomes a <strong>CRUSHING HIT</strong> instead.",
                "two":"Roll a <strong>HULL</strong> check. On a success, your mech is @Compendium[world.status-items.Impaired] and @Compendium[world.status-items.Slowed] until the end of your next turn. On a failure, you take the <strong>SYSTEM TRAUMA</strong> result from this table, and your mech is @Compendium[world.status-items.Impaired] and @Compendium[world.status-items.Immobilized] until the end of your next turn. If there are no valid systems or weapons remaining, this result becomes a <strong>CRUSHING HIT</strong> instead."
            },
            "systemTrauma":"Parts of your mech are torn off by the damage. Roll 1d6. On a 1–3, all weapons on one mount of your choice are destroyed; on a 4–6, a system of your choice is destroyed. LIMITED systems and weapons that are out of charges are not valid choices. If there are no valid choices remaining, it becomes the other result. If there are no valid systems or weapons remaining, this result becomes a <strong>DIRECT HIT</strong> instead.",
            "glancingBlow":"Emergency systems kick in and stabilize your mech, but it’s @Compendium[world.status-items.Impaired] until the end of your next turn."
        },
        "StructureTitles": {
            "noStructure": "Destroyed",
            "crushingHit": "Crushing Hit",
            "directHit": "Direct Hit",
            "systemTrauma": "System Trauma",
            "glancingBlow":"Glancing Blow"
        },
        "StressDescriptions":{
            
            "noStress": "The reactor goes critical – your mech suffers a reactor meltdown at the end of your next turn.",
            "criticalFail": "Your Mech is @Compendium[world.status-items.Exposed], deals half damage, heat, and burn on attacks, and suffers a reactor meltdown at the end of your next turn. You can end this effect by stabilizing, or by passing an <strong>ENGINEERING</strong> check as a quick action.",
            "meltdown": {
                "base": "Roll an <strong>ENGINEERING</strong> check. On a success, your mech is @Compendium[world.status-items.Slowed] and Deals half damage, heat, and burn on attacks until the end of your next turn. On a failure, your mech becomes @Compendium[world.status-items.Exposed].",
                "one": "Your mech is @Compendium[world.status-items.Exposed], and you must pass an <strong>ENGINEERING</strong> check. On a success, It deals half damage, heat and burn until the end of your next turn. On a failure, your mech suffers a reactor meltdown after 1d3 of your turns. This effect can be ended by stabilizing, or by passing an <strong>ENGINEERING</strong> check as a quick action.",
                "two": "Your mech must roll an <strong>ENGINEERING</strong> check. On a success, it is @Compendium[world.status-items.Slowed] and deals half damage, heat, and Burn on attacks until the end of your next turn. On a failure, it is @Compendium[world.status-items.Exposed] and suffers a reactor meltdown after 1d3 of your turns (rolled by the GM). This effect can be ended by stabilizing, or by making a successful <strong>ENGINEERING</strong> check as a quick action."
            },
            "powerFail": "Your mech suffers catastrophic disruption to power regulation as it tries to divert energy to critical safety systems. Your mech is @Compendium[world.status-items.Slowed] and Deals Half damage, heat, and burn on attacks until the end of your next turn.",
            "emergencyShunt": "Your mech’s cooling systems manage to contain the increasing heat; however, your mech becomes @Compendium[world.status-items.Impaired] until the end of your next turn."
        },        
        "StressTitles": {
            "noStress": "Overheat",
            "criticalFail": "Critical Reactor Failure",
            "meltdown": "Meltdown",
            "powerFail": "Power Failure",
            "emergencyShunt": "Emergency Shunt"
        }
    }
}